title GIT提交批处理——小二三不乌

color 12

echo 开始提交代码到本地仓库

echo 当前目录是：%cd%

echo 开始添加变更

echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

git add -A .


echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


echo 提交变更到本地仓库

echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


git commit -m "脚本"

echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

echo;

echo 将变更情况提交到远程github服务器

echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

git push github master

echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
echo 将变更情况提交到远程gitee服务器

echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

git push gitee master

echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

echo;

echo 批处理执行完毕！

echo;

pause
